<template>
  <dv-scroll-board :config="config" style="width: 100%; height: 100%" />
</template>
    
    <script>
export default {
  data() {
    return {
      config: {
        headerBGC: "transparent",
        header: ["任务名", "时间", "类型", "是否报警", "状态"],
        data: [
          ["渣土车预警", "2022/9/7", "机动车违法", "已报警", "采集中"],
          ["渣土车预警", "2022/9/7", "机动车违法", "已报警", "采集中"],
          ["渣土车预警", "2022/9/7", "机动车违法", "已报警", "采集中"],
          ["渣土车预警", "2022/9/7", "机动车违法", "已报警", "采集中"],
          ["渣土车预警", "2022/9/7", "机动车违法", "已报警", "采集中"],
          ["渣土车预警", "2022/9/7", "机动车违法", "已报警", "采集中"],
          ["渣土车预警", "2022/9/7", "机动车违法", "已报警", "采集中"],
          ["渣土车预警", "2022/9/7", "机动车违法", "已报警", "采集中"],
          ["渣土车预警", "2022/9/7", "机动车违法", "已报警", "采集中"],
        ],

        columnWidth: [100],
        align: ["center"],
        rowNum: "3",
        carousel: "single",
        oddRowBGC: "rgba(0, 67, 197,.5)",
        evenRowBGC: "rgba(81, 166, 255,.5)",
      },
    };
  },
};
</script>
    <style lang="scss" scoped>
</style>